CrossTheRoadElec/HERO-STM32F4-Applications/Drivers/BSP/STM32F4xx_HERO/stm32f4xx_hero.h
/** 
  ******************************************************************************
  * @file    stm32f4xx_hero.h
  * @author  MCD Application Team
  * @brief   This file contains definitions for:
  *          - LEDs and push-button available on STM32F4XX-Nucleo-144 Kit 
  *            from STMicroelectronics
  *          - LCD, joystick and microSD available on Adafruit 1.8" TFT LCD 
  *            shield (reference ID 802)
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2016 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************  
  */ 
  
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32F4XX_HERO__h_
#define __STM32F4XX_HERO__h_

#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"
   
  
/** @addtogroup BSP
  * @{
  */


typedef enum 
{
  LED1 = 0,
  LED_GREEN = LED1,
  LED2 = 1,
  LED_BLUE = LED2,
  LED3 = 2,
  LED_RED = LED3
}Led_TypeDef;

typedef enum 
{  
  BUTTON_USER = 0,
  /* Alias */
  BUTTON_KEY = BUTTON_USER
}Button_TypeDef;

typedef enum 
{  
  BUTTON_MODE_GPIO = 0,
  BUTTON_MODE_EXTI = 1
}ButtonMode_TypeDef;

typedef enum 
{ 
  JOY_NONE  = 0,
  JOY_SEL   = 1,
  JOY_DOWN  = 2,
  JOY_LEFT  = 3,
  JOY_RIGHT = 4,
  JOY_UP    = 5
}JOYState_TypeDef;

/**
  * @}
  */ 


/** 
  * @brief Define for STM32F4XX_HERO board  
  */ 
#if !defined (USE_STM32F4XX_HERO)
 #define USE_STM32F4XX_HERO
#endif

/** @defgroup STM32F4XX_NUCLEO_144_LOW_LEVEL_LED STM32F4XX NUCLEO 144 LOW LEVEL LED
  * @{
  */
#define LEDn                                    3

#define LED1_PIN                                GPIO_PIN_9
#define LED1_GPIO_PORT                          GPIOA
#define LED1_GPIO_CLK_ENABLE()                  __HAL_RCC_GPIOA_CLK_ENABLE()
#define LED1_GPIO_CLK_DISABLE()                 __HAL_RCC_GPIOA_CLK_DISABLE()  

#define LED2_PIN                                GPIO_PIN_9
#define LED2_GPIO_PORT                          GPIOD
#define LED2_GPIO_CLK_ENABLE()                  __HAL_RCC_GPIOD_CLK_ENABLE()
#define LED2_GPIO_CLK_DISABLE()                 __HAL_RCC_GPIOD_CLK_DISABLE()  

#define LED3_PIN                                GPIO_PIN_8
#define LED3_GPIO_PORT                          GPIOD
#define LED3_GPIO_CLK_ENABLE()                  __HAL_RCC_GPIOD_CLK_ENABLE()
#define LED3_GPIO_CLK_DISABLE()                 __HAL_RCC_GPIOD_CLK_DISABLE()  

#define LEDx_GPIO_CLK_ENABLE(__INDEX__)\
	do { 																						\
		switch(__INDEX__) {														\
			case LED1: LED1_GPIO_CLK_ENABLE(); break;		\
			case LED2: LED2_GPIO_CLK_ENABLE(); break;		\
			case LED3: LED3_GPIO_CLK_ENABLE(); break;		\
		}																							\
	} while(0)

#define LEDx_GPIO_CLK_DISABLE(__INDEX__)\
	do { 																						\
		switch(__INDEX__) {														\
			case LED1: LED1_GPIO_CLK_DISABLE(); break;	\
			case LED2: LED2_GPIO_CLK_DISABLE(); break;	\
			case LED3: LED3_GPIO_CLK_DISABLE(); break;	\
		}																							\
	} while(0)

/**
  * @}
  */ 
  
/** @defgroup STM32F4XX_NUCLEO_144_LOW_LEVEL_BUTTON STM32F4XX NUCLEO 144 LOW LEVEL BUTTON
  * @{
  */  
///#define BUTTONn                                 1  

///**
// * @brief Key push-button
// */
//#define USER_BUTTON_PIN                          GPIO_PIN_13
//#define USER_BUTTON_GPIO_PORT                    GPIOC
//#define USER_BUTTON_GPIO_CLK_ENABLE()            __HAL_RCC_GPIOC_CLK_ENABLE()
//#define USER_BUTTON_GPIO_CLK_DISABLE()           __HAL_RCC_GPIOC_CLK_DISABLE()
//#define USER_BUTTON_EXTI_LINE                    GPIO_PIN_13
//#define USER_BUTTON_EXTI_IRQn                    EXTI15_10_IRQn

//#define BUTTONx_GPIO_CLK_ENABLE(__INDEX__)      USER_BUTTON_GPIO_CLK_ENABLE()
//#define BUTTONx_GPIO_CLK_DISABLE(__INDEX__)     USER_BUTTON_GPIO_CLK_DISABLE() 

///* Aliases */
//#define KEY_BUTTON_PIN                       USER_BUTTON_PIN
//#define KEY_BUTTON_GPIO_PORT                 USER_BUTTON_GPIO_PORT
//#define KEY_BUTTON_GPIO_CLK_ENABLE()         USER_BUTTON_GPIO_CLK_ENABLE()
//#define KEY_BUTTON_GPIO_CLK_DISABLE()        USER_BUTTON_GPIO_CLK_DISABLE()
//#define KEY_BUTTON_EXTI_LINE                 USER_BUTTON_EXTI_LINE
//#define KEY_BUTTON_EXTI_IRQn                 USER_BUTTON_EXTI_IRQn


///**
//  * @brief OTG_FS1 OVER_CURRENT and POWER_SWITCH Pins definition
//  */


//#define OTG_FS1_OVER_CURRENT_PIN                  GPIO_PIN_7
//#define OTG_FS1_OVER_CURRENT_PORT                 GPIOG
//#define OTG_FS1_OVER_CURRENT_PORT_CLK_ENABLE()     __HAL_RCC_GPIOG_CLK_ENABLE()

//#define OTG_FS1_POWER_SWITCH_PIN                  GPIO_PIN_6
//#define OTG_FS1_POWER_SWITCH_PORT                 GPIOG
//#define OTG_FS1_POWER_SWITCH_PORT_CLK_ENABLE()     __HAL_RCC_GPIOG_CLK_ENABLE()

/**
  * @}
  */ 

/** @defgroup STM32F4XX_NUCLEO_144_LOW_LEVEL_BUS STM32F4XX NUCLEO 144 LOW LEVEL BUS
  * @{
  */
/*############################### SPI_A #######################################*/
//#ifdef HAL_SPI_MODULE_ENABLED

//#define NUCLEO_SPIx                                     SPI1
//#define NUCLEO_SPIx_CLK_ENABLE()                        __HAL_RCC_SPI1_CLK_ENABLE()

//#define NUCLEO_SPIx_SCK_AF                              GPIO_AF5_SPI1
//#define NUCLEO_SPIx_SCK_GPIO_PORT                       GPIOA
//#define NUCLEO_SPIx_SCK_PIN                             GPIO_PIN_5
//#define NUCLEO_SPIx_SCK_GPIO_CLK_ENABLE()               __HAL_RCC_GPIOA_CLK_ENABLE()
//#define NUCLEO_SPIx_SCK_GPIO_CLK_DISABLE()              __HAL_RCC_GPIOA_CLK_DISABLE()

//#define NUCLEO_SPIx_MISO_MOSI_AF                        GPIO_AF5_SPI1
//#define NUCLEO_SPIx_MISO_MOSI_GPIO_PORT                 GPIOA
//#define NUCLEO_SPIx_MISO_MOSI_GPIO_CLK_ENABLE()         __HAL_RCC_GPIOA_CLK_ENABLE()
//#define NUCLEO_SPIx_MISO_MOSI_GPIO_CLK_DISABLE()        __HAL_RCC_GPIOA_CLK_DISABLE()
//#define NUCLEO_SPIx_MISO_PIN                            GPIO_PIN_6
//#define NUCLEO_SPIx_MOSI_PIN                            GPIO_PIN_7
///* Maximum Timeout values for flags waiting loops. These timeout are not based
//   on accurate values, they just guarantee that the application will not remain
//   stuck if the SPI communication is corrupted.
//   You may modify these timeout values depending on CPU frequency and application
//   conditions (interrupts routines ...). */   
//#define NUCLEO_SPIx_TIMEOUT_MAX                   1000

//#define NUCLEO_SPIx_CS_GPIO_PORT                        GPIOD
//#define NUCLEO_SPIx_CS_PIN                              GPIO_PIN_14
//#define NUCLEO_SPIx_CS_GPIO_CLK_ENABLE()                __HAL_RCC_GPIOD_CLK_ENABLE()
//#define NUCLEO_SPIx_CS_GPIO_CLK_DISABLE()               __HAL_RCC_GPIOD_CLK_DISABLE()

//#define SPIx__CS_LOW()       HAL_GPIO_WritePin(NUCLEO_SPIx_CS_GPIO_PORT, NUCLEO_SPIx_CS_PIN, GPIO_PIN_RESET)
//#define SPIx__CS_HIGH()      HAL_GPIO_WritePin(NUCLEO_SPIx_CS_GPIO_PORT, NUCLEO_SPIx_CS_PIN, GPIO_PIN_SET)

///**
//  * @brief  SD Control Lines management
//  */
//#define SD_CS_LOW()       HAL_GPIO_WritePin(SD_CS_GPIO_PORT, SD_CS_PIN, GPIO_PIN_RESET)
//#define SD_CS_HIGH()      HAL_GPIO_WritePin(SD_CS_GPIO_PORT, SD_CS_PIN, GPIO_PIN_SET)

///**
//  * @brief  LCD Control Lines management
//  */
//#define LCD_CS_LOW()      HAL_GPIO_WritePin(LCD_CS_GPIO_PORT, LCD_CS_PIN, GPIO_PIN_RESET)
//#define LCD_CS_HIGH()     HAL_GPIO_WritePin(LCD_CS_GPIO_PORT, LCD_CS_PIN, GPIO_PIN_SET)
//#define LCD_DC_LOW()      HAL_GPIO_WritePin(LCD_DC_GPIO_PORT, LCD_DC_PIN, GPIO_PIN_RESET)
//#define LCD_DC_HIGH()     HAL_GPIO_WritePin(LCD_DC_GPIO_PORT, LCD_DC_PIN, GPIO_PIN_SET)
//     
///**
//  * @brief  SD Control Interface pins (shield D4)
//  */
//#define SD_CS_PIN                                 GPIO_PIN_14
//#define SD_CS_GPIO_PORT                           GPIOF
//#define SD_CS_GPIO_CLK_ENABLE()                 __HAL_RCC_GPIOF_CLK_ENABLE()
//#define SD_CS_GPIO_CLK_DISABLE()                __HAL_RCC_GPIOF_CLK_DISABLE()

///**
//  * @brief  LCD Control Interface pins (shield D10)
//  */
//#define LCD_CS_PIN                                 GPIO_PIN_14
//#define LCD_CS_GPIO_PORT                           GPIOD
//#define LCD_CS_GPIO_CLK_ENABLE()                 __HAL_RCC_GPIOD_CLK_ENABLE()
//#define LCD_CS_GPIO_CLK_DISABLE()                __HAL_RCC_GPIOD_CLK_DISABLE()
//    
///**
//  * @brief  LCD Data/Command Interface pins (shield D8)
//  */
//#define LCD_DC_PIN                                 GPIO_PIN_12
//#define LCD_DC_GPIO_PORT                           GPIOF
//#define LCD_DC_GPIO_CLK_ENABLE()                 __HAL_RCC_GPIOF_CLK_ENABLE()
//#define LCD_DC_GPIO_CLK_DISABLE()                __HAL_RCC_GPIOF_CLK_DISABLE()

//#endif /* HAL_SPI_MODULE_ENABLED */

///*################################ ADCx for Nucleo 144 board ######################################*/
///**
//  * @brief  ADCx Interface pins
//  *         used to detect motion of Joystick available on Adafruit 1.8" TFT shield
//  */
//  
///* For some Nucleo144 boards, Arduino UNO pin7 (A3) is connected to PF3 in others to PC01 */ 
//#if defined(ADC3) 
//#define NUCLEO_ADCx                          ADC3
//#define NUCLEO_ADCx_CLK_ENABLE()             __HAL_RCC_ADC3_CLK_ENABLE()
//#define NUCLEO_ADCx_CLK_DISABLE()            __HAL_RCC_ADC3_CLK_DISABLE()

//#define NUCLEO_ADCx_CHANNEL                  ADC_CHANNEL_9
//#define NUCLEO_ADCx_GPIO_PORT                GPIOF
//#define NUCLEO_ADCx_GPIO_PIN                 GPIO_PIN_3
//#define NUCLEO_ADCx_GPIO_CLK_ENABLE()        __HAL_RCC_GPIOF_CLK_ENABLE()
//#define NUCLEO_ADCx_GPIO_CLK_DISABLE()       __HAL_RCC_GPIOF_CLK_DISABLE()

//#else
//#define NUCLEO_ADCx                          ADC1
//#define NUCLEO_ADCx_CLK_ENABLE()             __HAL_RCC_ADC1_CLK_ENABLE()
//#define NUCLEO_ADCx_CLK_DISABLE()            __HAL_RCC_ADC1_CLK_DISABLE()
//#define NUCLEO_ADCx_CHANNEL                  ADC_CHANNEL_11
//   
//#define NUCLEO_ADCx_GPIO_PORT                GPIOC
//#define NUCLEO_ADCx_GPIO_PIN                 GPIO_PIN_1
//#define NUCLEO_ADCx_GPIO_CLK_ENABLE()        __HAL_RCC_GPIOC_CLK_ENABLE()
//#define NUCLEO_ADCx_GPIO_CLK_DISABLE()       __HAL_RCC_GPIOC_CLK_DISABLE()
//#endif /* HAL_ADC_MODULE_ENABLED */

/**
  * @}
  */

/**
  * @}
  */

/** @defgroup STM32F4XX_NUCLEO_144_LOW_LEVEL_Exported_Macros STM32F4XX NUCLEO 144 LOW LEVEL Exported Macros
  * @{
  */  
/**
  * @}
  */ 

/** @defgroup STM32F4XX_NUCLEO_144_LOW_LEVEL_Exported_Functions STM32F4XX NUCLEO 144 LOW LEVEL Exported Functions
  * @{
  */
uint32_t         BSP_GetVersion(void);  
void             BSP_LED_Init(Led_TypeDef Led);
void             BSP_LED_DeInit(Led_TypeDef Led);
void             BSP_LED_On(Led_TypeDef Led);
void             BSP_LED_Off(Led_TypeDef Led);
void             BSP_LED_Toggle(Led_TypeDef Led);
void             BSP_PB_Init(Button_TypeDef Button, ButtonMode_TypeDef ButtonMode);
void             BSP_PB_DeInit(Button_TypeDef Button);
uint32_t         BSP_PB_GetState(Button_TypeDef Button);
#ifdef HAL_ADC_MODULE_ENABLED
uint8_t          BSP_JOY_Init(void);
JOYState_TypeDef BSP_JOY_GetState(void);
void             BSP_JOY_DeInit(void);
#endif /* HAL_ADC_MODULE_ENABLED */

  
/**
  * @}
  */ 

/**
  * @}
  */ 

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __STM32F4XX_HERO__h_ */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
